(1) Import pandas under the alias pd

In [1]:
import pandas as pd

(2) Show the version of pandas imported

In [2]:
pd.__version__

'0.19.2'

(3) Run the following code to create the objects `data` and `labels`:

In [3]:
data = {'Name': ['John A', 'John B', 'Jane A', 'Jane B', 'Yaron A', 'Yaron B', 'Moran A', 'Moran B'],
        'gender': ['M', 'M', 'F', 'F', 'M', 'M', 'F', 'F'],
        'age': [3, 70, None, 50, 32, 37, 45, 38],
        'Weight':[15, 75, 25, 100, 85, 80, 175, 65],
        'Height': [90, 140, 110, 170, 180, 175, 190, 160],
        'Superhero': ['No', 'Yes','No', 'Yes', 'No', 'Yes', 'No', 'Yes']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h']

(4) Create a pandas dataframe df with `data`, using `labels` as the index

In [4]:
df = pd.DataFrame(data, index=labels)

(5) Use the dataframe info method to show summary information on df:

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, a to h
Data columns (total 6 columns):
Height       8 non-null int64
Name         8 non-null object
Superhero    8 non-null object
Weight       8 non-null int64
age          7 non-null float64
gender       8 non-null object
dtypes: float64(1), int64(2), object(3)
memory usage: 448.0+ bytes

(6) Show the summary statistics on the numerical columns:

In [6]:
df.describe()

           Height      Weight        age
count    8.000000    8.000000   7.000000
mean   151.875000   77.500000  39.285714
std     35.650836   49.135381  20.279006
min     90.000000   15.000000   3.000000
25%    132.500000   55.000000  34.500000
50%    165.000000   77.500000  38.000000
75%    176.250000   88.750000  47.500000
max    190.000000  175.000000  70.000000

(7) Disaply the first 3 rows of df

In [7]:
df.head(3)

   Height    Name Superhero  Weight   age gender
a      90  John A        No      15   3.0      M
b     140  John B       Yes      75  70.0      M
c     110  Jane A        No      25   NaN      F

(8) Display only the rows with labels 'a', 'c', and 'e'

In [8]:
df.loc[['a','c','e']]

   Height     Name Superhero  Weight   age gender
a      90   John A        No      15   3.0      M
c     110   Jane A        No      25   NaN      F
e     180  Yaron A        No      85  32.0      M

(9) Display every other row

In [9]:
df.iloc[::2]

   Height     Name Superhero  Weight   age gender
a      90   John A        No      15   3.0      M
c     110   Jane A        No      25   NaN      F
e     180  Yaron A        No      85  32.0      M
g     190  Moran A        No     175  45.0      F

(10) Display only the 'Name' and 'Superhero' columns for the entire dataframe

In [10]:
df[['Name', 'Superhero']]

      Name Superhero
a   John A        No
b   John B       Yes
c   Jane A        No
d   Jane B       Yes
e  Yaron A        No
f  Yaron B       Yes
g  Moran A        No
h  Moran B       Yes

(11) Display only the 'Name' and 'Superhero' columns for the second, fourth, and seventh rows

In [11]:
df.iloc[[1,3,6]][['Name', 'Superhero']]

      Name Superhero
b   John B       Yes
d   Jane B       Yes
g  Moran A        No

(12) Display all rows where 'age' is equal or greater than 50

In [12]:
df[df['age']>=50]

   Height    Name Superhero  Weight   age gender
b     140  John B       Yes      75  70.0      M
d     170  Jane B       Yes     100  50.0      F

(13) Display all rows where 'age' has a missing value

In [13]:
df[df['age'].isnull()]

   Height    Name Superhero  Weight  age gender
c     110  Jane A        No      25  NaN      F

(14) Display all Superheros that are taller than 110

In [14]:
df[(df['Height']>110)&(df['Superhero']=='Yes')]

   Height     Name Superhero  Weight   age gender
b     140   John B       Yes      75  70.0      M
d     170   Jane B       Yes     100  50.0      F
f     175  Yaron B       Yes      80  37.0      M
h     160  Moran B       Yes      65  38.0      F

(15) Display all rows where

In [15]:
df[df['age'].between(30,40)]

   Height     Name Superhero  Weight   age gender
e     180  Yaron A        No      85  32.0      M
f     175  Yaron B       Yes      80  37.0      M
h     160  Moran B       Yes      65  38.0      F

(16) Set the age at row 'c' to 5

In [16]:
df.loc['c', 'age'] = 5

(17) Calculate the overall weight measured in the data

In [17]:
df['Weight'].sum()

620

(18) Separating by Superhero status - calculate the mean age.

In [18]:
df.groupby('Superhero')['age'].mean()

Superhero
No     21.25
Yes    48.75
Name: age, dtype: float64

(19) Add a new row 'i' with your own values

In [19]:
df.loc['i'] = [90, 'Rando A', 'No', 10, 100, 'M']

(20) Remove row 'i'

In [20]:
df.drop('i', inplace=True)

(21) Count how many of the rows are Male and how many Female

In [21]:
df['gender'].value_counts()

M    4
F    4
Name: gender, dtype: int64

(22) Show the dataframe sorted by age, descending (oldest first)

In [29]:
df.sort_values(by=['age'], ascending=False)

   Height     Name Superhero  Weight   age gender        BMI
b     140   John B      True      75  70.0      M  38.265306
d     170   Jane B      True     100  50.0      F  34.602076
g     190  Moran A     False     175  45.0      F  48.476454
h     160  Moran B      True      65  38.0      F  25.390625
f     175  Yaron B      True      80  37.0      M  26.122449
e     180  Yaron A     False      85  32.0      M  26.234568
c     110   Jane A     False      25   5.0      F  20.661157
a      90   John A     False      15   3.0      M  18.518519

(23) Change the Superhero column to boolean values

In [23]:
df['Superhero'] = df['Superhero'].map({'Yes':True, 'No':False})

(24) Separating by gender and superhero status, calculate the mean Height, Weight, and age

In [24]:
df.groupby(['gender', 'Superhero']).mean()

                  Height  Weight   age
gender Superhero
F      False       150.0   100.0  25.0
       True        165.0    82.5  44.0
M      False       135.0    50.0  17.5
       True        157.5    77.5  53.5

(25) Add a column containing the calculated [BMI](https://en.wikipedia.org/wiki/Body_mass_index) for each row.
Assume height is in cm, weight in kg.

In [25]:
def BMI(row):
    Weight = row.Weight
    Height = 0.01*row.Height
    BMI = (Weight/(Height**2))
    return BMI

df['BMI'] = df.apply(BMI, axis=1)

(26) Show the index for the row with the highest BMI

In [27]:
df['BMI'].idxmax()

'g'